# üìä –£—Ä–æ–∫ 04 ‚Äî –û–±—Ä–∞–±–æ—Ç–∫–∞ –∏ –∞–≥—Ä–µ–≥–∞—Ü–∏—è –¥–∞–Ω–Ω—ã—Ö –≤ Pandas

**–¶–µ–ª—å:** –ù–∞—É—á–∏—Ç—å—Å—è —ç—Ñ—Ñ–µ–∫—Ç–∏–≤–Ω–æ –≤—ã–±–∏—Ä–∞—Ç—å, –∞–≥—Ä–µ–≥–∏—Ä–æ–≤–∞—Ç—å –∏ –æ–±—ä–µ–¥–∏–Ω—è—Ç—å –¥–∞–Ω–Ω—ã–µ –≤ Pandas.

**–¢–µ–º—ã:**
- –í—ã–±–æ—Ä –¥–∞–Ω–Ω—ã—Ö (–∏–Ω–¥–µ–∫—Å–∞—Ü–∏—è, —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏—è)
- –ê–≥—Ä–µ–≥–∞—Ü–∏—è (groupby, sum, mean, count)
- –û–±—ä–µ–¥–∏–Ω–µ–Ω–∏–µ —Ç–∞–±–ª–∏—Ü (merge, join)
- –¢—Ä–∞–Ω—Å—Ñ–æ—Ä–º–∞—Ü–∏—è (apply, map, fillna)
- –£—Ç–∏–ª–∏—Ç—ã (isnull, sort_values, reset_index)

In [9]:
# –ò–º–ø–æ—Ä—Ç–∏—Ä—É–µ–º –±–∏–±–ª–∏–æ—Ç–µ–∫–∏
import pandas as pd
import numpy as np

## 1Ô∏è‚É£ –ó–∞–≥—Ä—É–∑–∫–∞ –∏ –ø—Ä–æ—Å–º–æ—Ç—Ä –¥–∞–Ω–Ω—ã—Ö

In [11]:
# –ü—Ä–∏–º–µ—Ä –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–∞
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Department': ['HR', 'IT', 'IT', 'HR', 'Marketing'],
    'Salary': [50000, 60000, 65000, 52000, 58000],
    'Age': [25, 30, 35, 45, 28]
}
df = pd.DataFrame(data)
df

      Name Department  Salary  Age
0    Alice         HR   50000   25
1      Bob         IT   60000   30
2  Charlie         IT   65000   35
3    David         HR   52000   45
4      Eva  Marketing   58000   28

## 2Ô∏è‚É£ –í—ã–±–æ—Ä –∏ —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏—è –¥–∞–Ω–Ω—ã—Ö

In [12]:
# –í—Å–µ —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏ –∏–∑ IT
df[df['Department'] == 'IT']

      Name Department  Salary  Age
1      Bob         IT   60000   30
2  Charlie         IT   65000   35

## 3Ô∏è‚É£ –ê–≥—Ä–µ–≥–∞—Ü–∏—è ‚Äî groupby()

In [13]:
# –°—Ä–µ–¥–Ω—è—è –∑–∞—Ä–ø–ª–∞—Ç–∞ –ø–æ –æ—Ç–¥–µ–ª–∞–º
df.groupby('Department')['Salary'].mean()

Department
HR           51000.0
IT           62500.0
Marketing    58000.0
Name: Salary, dtype: float64

## 4Ô∏è‚É£ –û–±—ä–µ–¥–∏–Ω–µ–Ω–∏–µ —Ç–∞–±–ª–∏—Ü (merge)

In [5]:
extra = pd.DataFrame({
    'Name': ['Alice', 'Charlie', 'Eva'],
    'Bonus': [5000, 3000, 4000]
})
merged_df = pd.merge(df, extra, on='Name', how='left')
merged_df

      Name Department  Salary  Age   Bonus
0    Alice         HR   50000   25  5000.0
1      Bob         IT   60000   30     NaN
2  Charlie         IT   65000   35  3000.0
3    David         HR   52000   45     NaN
4      Eva  Marketing   58000   28  4000.0

## 5Ô∏è‚É£ –¢—Ä–∞–Ω—Å—Ñ–æ—Ä–º–∞—Ü–∏—è –¥–∞–Ω–Ω—ã—Ö

In [14]:
# –î–æ–±–∞–≤–∏–º —Å—Ç–æ–ª–±–µ—Ü —Å –≤–æ–∑—Ä–∞—Å—Ç–Ω–æ–π –∫–∞—Ç–µ–≥–æ—Ä–∏–µ–π
df['AgeGroup'] = df['Age'].apply(lambda x: 'Young' if x < 30 else 'Senior')
df

      Name Department  Salary  Age AgeGroup
0    Alice         HR   50000   25    Young
1      Bob         IT   60000   30   Senior
2  Charlie         IT   65000   35   Senior
3    David         HR   52000   45   Senior
4      Eva  Marketing   58000   28    Young

## 6Ô∏è‚É£ –£—Ç–∏–ª–∏—Ç—ã Pandas

In [7]:
# –ü—Ä–æ–≤–µ—Ä–∏–º –ø—Ä–æ–ø—É—Å–∫–∏
merged_df.isnull().sum()

Name          0
Department    0
Salary        0
Age           0
Bonus         2
dtype: int64